''' ********************************************************************
    题目描述
    输入n个整数，找出其中最小的K个数。例如输入4,5,1,6,2,7,3,8这8个数字，
    则最小的4个数字是1,2,3,4,。
******************************************************************** ''' 
# -*- coding:utf-8 -*-
class Solution:
    def GetLeastNumbers_Solution(self, tinput, k):
        if k<1 or k>len(tinput) or not tinput:
            return []
        LK=tinput[:k]
        for i in range(k,len(tinput)):
            m = max(LK)
            if tinput[i]<m:
                LK[LK.index(m)]=tinput[i]
        return sorted(LK)
''' ********************************************************************
    解题思路：

******************************************************************** '''


