''' ********************************************************************
    题目描述
    将一个字符串转换成一个整数(实现Integer.valueOf(string)的功能，
    但是string不符合数字要求时返回0)，要求不能使用字符串转换整数的库函数。 
    数值为0或者字符串不是一个合法的数值则返回0。
******************************************************************** ''' 
# -*- coding:utf-8 -*-
class Solution:
    def StrToInt(self, s):
        try:
            number = int(s)
            return number
        except:
            return 0
''' ********************************************************************
    解题思路：

******************************************************************** '''
if __name__ == '__main__':
    ins = Solution()
    s = '+12a3'
    print(ins.StrToInt(s))
    s = '-12'
    print(ins.StrToInt(s))

