''' ********************************************************************
    题目描述
    输入一个递增排序的数组和一个数字S，在数组中查找两个数，使得他们的和正好是S，
    如果有多对数字的和等于S，输出两个数的乘积最小的。
******************************************************************** ''' 
# -*- coding:utf-8 -*-
class Solution:
    def FindNumbersWithSum(self, array, tsum):
        n = len(array)
        if n>2:
            i,j = 0,n-1
            while j>i:
                while array[j] > tsum-array[i]:
                    j -= 1
                if array[j] == tsum-array[i]:
                    return array[i],array[j]
                i += 1
        return []
''' ********************************************************************
    解题思路：

******************************************************************** '''
if __name__ == '__main__':
    ins = Solution()
    pass


