''' ********************************************************************
    题目描述
    输入一个英文句子，翻转句子中单词的顺序，但单词内字符的顺序不变，默认标点符号与单词等同，
    例如“I am a student.”，翻转后为“student. a am I”
******************************************************************** ''' 
# -*- coding:utf-8 -*-
class Solution:
    def ReverseSentence(self, s):
        s = s.split(' ')
        s.reverse()
        return ' '.join(s)
''' ********************************************************************
    解题思路：

******************************************************************** '''


