''' ********************************************************************
    题目描述
    0到n-1这n个数围成一个圈，从数字0开始，每次从这个圈中删除第m个数，然后从删除的
    数后面的继续删除第m个数，知道还有一个数，求剩下的最后一个数。
******************************************************************** ''' 
# -*- coding:utf-8 -*-
class Solution:
    def LastRemaining_Solution(self, n, m):
        if n>1:
            L = list(range(n))
            for i in range(n-1):
                k = m%len(L)
                if k:
                    L = L[k:]+L[:k-1]
                else:
                    L = L[:-1]
            return L[0]
        return -1
''' ********************************************************************
    解题思路：

******************************************************************** '''
if __name__ == '__main__':
    ins = Solution()
    n, m = 5,3
    print(ins.LastRemaining_Solution(n,m))

